import 'ayat.dart';

class AppBrain {
  final List<Ayat> _ayat = [
    Ayat('﴿وَاصبِر فَإِنَّ اللَّهَ لا يُضيعُ أَجرَ المُحسِنينَ﴾', '[Hud: 115]',
        'واصبر على فعل ما أُمرت به من الاستقامة وغيرها، وعلى ترك ما نُهيت عنه من الطغيان والركون إلى الظَّلَمة، إن الله لا يبطل ثواب المحسنين، بل يتقبل منهم أحسن الذي عملوا، ويجزيهم أجرهم بأحسن ما كانوا يعملون.'),
    Ayat(
        '﴿وَقالَ رَبُّكُمُ ادعوني أَستَجِب لَكُم إِنَّ الَّذينَ يَستَكبِرونَ عَن عِبادَتي سَيَدخُلونَ جَهَنَّمَ داخِرينَ﴾',
        '[Ghafir: 60]',
        'وقال ربكم - أيها الناس -: وحِّدوني في العبادة والمسألة، أجب دعاءكم وأعفُ عنكم وأرحمكم، إن الذين يتعظمون عن إفرادي بالعبادة سيدخلون يوم القيامة جهنم صاغرين ذليلين.'),
    Ayat('﴿فَما ظَنُّكُم بِرَبِّ العالَمينَ﴾', '[As-saffat: 87]',
        'فما ظنكم - يا قوم - برب العالمين إذا لقيتموه وأنتم تعبدون غيره؟! وماذا ترونه صانعًا بكم؟!'),
    Ayat(
        '﴿إِلّا تَنصُروهُ فَقَد نَصَرَهُ اللَّهُ إِذ أَخرَجَهُ الَّذينَ كَفَروا ثانِيَ اثنَينِ إِذ هُما فِي الغارِ إِذ يَقولُ لِصاحِبِهِ لا تَحزَن إِنَّ اللَّهَ مَعَنا فَأَنزَلَ اللَّهُ سَكينَتَهُ عَلَيهِ وَأَيَّدَهُ بِجُنودٍ لَم تَرَوها وَجَعَلَ كَلِمَةَ الَّذينَ كَفَرُوا السُّفلى وَكَلِمَةُ اللَّهِ هِيَ العُليا وَاللَّهُ عَزيزٌ حَكيمٌ﴾',
        '[At-Tawbah: 40]',
        'إن لم تنصروا - أيها المؤمنون - رسول الله صلى الله عليه وسلم، وتستجيبوا لدعوته للجهاد في سبيل الله، فقد نصره الله دون أن تكونوا معه حين أخرجه المشركون هو وأبا بكر رضي الله عنه، لا ثالث لهما حين كانا في غار ثور مستخفيَيْن من الكفار الذين كانوا يبحثون عنهما، حين يقول رسول الله صلى الله عليه وسلم لصاحبه أبي بكر الصديق حين خاف عليه أن يدركه المشركون: لا تحزن إن الله معنا بتأييده ونصره، فأنزل الله الطمأنينة على قلب رسوله، وأنزل عليه جنودًا لا تشاهدونهم وهم الملائكة يؤيدونه، وصيَّر كلمة المشركين السفلى، وكلمة الله هي العليا حين أعلى الإسلام، والله عزيز في ذاته وقهره وملكه، لا يغالبه أحد، حكيم في تدبيره وقدره وشرعه.'),
    Ayat('﴿قالَ قَد أوتيتَ سُؤلَكَ يا موسى﴾', '[Ṭa Ha: 36]',
        'قال الله: قد أعطيناك ما طلبت يا موسى.'),
    Ayat('﴿وَفِي السَّماءِ رِزقُكُم وَما توعَدونَ﴾', '[Adh-Dhariyat: 22]',
        'وفي السماء رزقكم الدنيوي والديني، وفيها ما توعدون من خير أو شر.'),
    Ayat(
        '﴿قُل يا عِبادِيَ الَّذينَ أَسرَفوا عَلى أَنفُسِهِم لا تَقنَطوا مِن رَحمَةِ اللَّهِ إِنَّ اللَّهَ يَغفِرُ الذُّنوبَ جَميعًا إِنَّهُ هُوَ الغَفورُ الرَّحيمُ﴾',
        '[Az-Zumar: 53]',
        'قل - أيها الرسول - لعبادي الذين تجاوزوا الحد على أنفسهم بالشرك بالله وارتكاب المعاصي: لا تَيْئَسُوا من رحمة الله، ومن مغفرته لذنوبكم، إن الله يغفر الذنوب كلها لمن تاب إليه، إنه هو الغفور لذنوب التائبين، الرحيم بهم.'),
    Ayat(
        '﴿فَأَعرِض عَن مَن تَوَلّى عَن ذِكرِنا وَلَم يُرِد إِلَّا الحَياةَ الدُّنيا﴾',
        '[An-Najm: 29]',
        'فأعرض - أيها الرسول - عمن أدبر عن ذكر الله ولم يعبأ به، ولم يرد إلا الحياة الدنيا، فهو لا يعمل لآخرته؛ لأنه لا يؤمن بها.'),
    Ayat(
        '﴿قُل لَن يُصيبَنا إِلّا ما كَتَبَ اللَّهُ لَنا هُوَ مَولانا وَعَلَى اللَّهِ فَليَتَوَكَّلِ المُؤمِنونَ﴾',
        '[At-Tawbah: 51]',
        'قل - أيها الرسول - لهؤلاء المنافقين: لن ينالنا إلا ما كتبه الله لنا، فهو سبحانه سيدنا وملجؤنا الذي نلجأ إليه، ونحن متوكلون عليه في أمورنا، وإليه وحده يفوض المؤمنون أمورهم، فهو كافيهم، ونعم الوكيل.'),
    Ayat(
        '﴿إِذ تَستَغيثونَ رَبَّكُم فَاستَجابَ لَكُم أَنّي مُمِدُّكُم بِأَلفٍ مِنَ المَلائِكَةِ مُردِفينَ﴾',
        '[Al-Anfal: 9]',
        'واذكروا يوم بدر حين طلبتم الغوث من الله بالنصر على عدوكم، فاستجاب الله لكم بأنه ممدكم - أيها المؤمنون - ومعينكم بألف من الملائكة، متتابعين يتبع بعضهم بعضًا.'),
    Ayat('﴿ما أَنزَلنا عَلَيكَ القُرآنَ لِتَشقى﴾', '[Ṭa Ha: 2]',
        'ما أنزلنا عليك - أيها الرسول - القرآن ليكون سببًا في إرهاق نفسك أسفًا على إعراض قومك عن الإيمان بك.'),
    Ayat(
        '﴿وَإِذا قَرَأتَ القُرآنَ جَعَلنا بَينَكَ وَبَينَ الَّذينَ لا يُؤمِنونَ بِالآخِرَةِ حِجابًا مَستورًا﴾ ',
        '[Al-Isra’: 45]',
        'وإذا قرأت - أيها الرسول - القرآن فسمعوا ما فيه من الزواجر والمواعظ جعلنا بينك وبين الذين لا يؤمنون بيوم القيامة حجابًا ساترًا يمنعهم من فهم القرآن عقابًا لهم على إعراضهم.'),
    Ayat(
        '﴿وَنُنَزِّلُ مِنَ القُرآنِ ما هُوَ شِفاءٌ وَرَحمَةٌ لِلمُؤمِنينَ وَلا يَزيدُ الظّالِمينَ إِلّا خَسارًا﴾',
        '[Al-Isra’: 82]',
        'وننزّل من القرآن ما هو شفاء للقلوب من الجهل والكفر والشك، وما هو شفاء للأبدان إذا رقيت به، وما هو رحمة للمؤمنين العاملين به، ولا يزيد هذا القرآن الكفار إلا هلاكًا؛ لأن سماعه يغيظهم، ويزيدهم تكذيبًا وإعراضًا عنه.'),
    Ayat(
        '﴿لا يُكَلِّفُ اللَّهُ نَفسًا إِلّا وُسعَها لَها ما كَسَبَت وَعَلَيها مَا اكتَسَبَت رَبَّنا لا تُؤاخِذنا إِن نَسينا أَو أَخطَأنا رَبَّنا وَلا تَحمِل عَلَينا إِصرًا كَما حَمَلتَهُ عَلَى الَّذينَ مِن قَبلِنا رَبَّنا وَلا تُحَمِّلنا ما لا طاقَةَ لَنا بِهِ وَاعفُ عَنّا وَاغفِر لَنا وَارحَمنا أَنتَ مَولانا فَانصُرنا عَلَى القَومِ الكافِرينَ﴾',
        '[Al-Baqarah: 286]',
        'لا يكلف الله نفسًا إلا ما تطيق من الأعمال؛ لأن دين الله مبني على اليسر فلا مشقة فيه، فمن كسب خيرًا فله ثواب ما عمل لا يُنْقَصُ منه شيء، ومن كسب شرًّا فعليه جزاء ما اكتسب من ذنب لا يحمله عنه غيره. وقال الرسول والمؤمنون: ربنا لا تعاقبنا إن نسينا أو أخطأنا في فعل أو قول بلا قصد منا، ربنا ولا تكلِّفنا ما يشق علينا ولا نطيقه، كما كلَّفت من قبلنا ممن عاقبتهم على ظلمهم كاليهود، ولا تحمِّلنا ما يشق علينا ولا نطيقه من الأوامر والنواهي، وتجاوز عن ذنوبنا، واغفر لنا، وارحمنا بفضلك، أنت ولينا وناصرنا فانصرنا على القوم الكافرين.'),
    Ayat(
        '﴿وَاستَغفِرِ اللَّهَ إِنَّ اللَّهَ كانَ غَفورًا رَحيمًا﴾',
        '[An-Nisa’: 106]',
        'واطلب المغفرة والعفو من الله، إن الله كان غفورًا لمن تاب إليه من عباده، رحيمًا به.'),
    Ayat(
        '﴿يا أَيُّهَا الَّذينَ آمَنوا ما لَكُم إِذا قيلَ لَكُمُ انفِروا في سَبيلِ اللَّهِ اثّاقَلتُم إِلَى الأَرضِ أَرَضيتُم بِالحَياةِ الدُّنيا مِنَ الآخِرَةِ فَما مَتاعُ الحَياةِ الدُّنيا فِي الآخِرَةِ إِلّا قَليلٌ﴾',
        '[At-Tawbah: 38]',
        'يا أيها الذين آمنوا بالله ورسوله وعملوا بما شرعه لهم، ما شأنكم إذا دُعِيتم إلى الجهاد في سبيل الله لقتال عدوكم تباطأتم، وملتم إلى الاستقرار في مساكنكم؟! أرضيتم بمتاع الحياة الدنيا الزائلة ولذاتها المنقطعة عوضًا عن نعيم الآخرة الدائم الذي أعده الله للمجاهدين في سبيله؟! فما متاع الحياة الدنيا في جنب الآخرة إلا حقير، فكيف لعاقل أن يختار فانيًا على باق، وحقيرًا على عظيم؟!'),
    Ayat(
        '﴿يا أَيُّهَا الَّذينَ آمَنوا إِذا نودِيَ لِلصَّلاةِ مِن يَومِ الجُمُعَةِ فَاسعَوا إِلى ذِكرِ اللَّهِ وَذَرُوا البَيعَ ذلِكُم خَيرٌ لَكُم إِن كُنتُم تَعلَمونَ﴾',
        '[Al-Jumu‘ah: 9]',
        'يا أيها الذين آمنوا بالله وعملوا بما شرعه لهم، إذا نادى المؤذن للصلاة من يوم الجمعة بعد صعود الخطيب على المنبر، فاسعوا إلى المساجد لحضور الخطبة والصلاة، واتركوا البيع؛ لئلا يشغلكم عن الطاعة، ذلك المأمور به من السعي وترك البيع بعد الأذان لصلاة الجمعة خير لكم - أيها المؤمنون - إن كنتم تعلمون ذلك، فامتثلوا ما أمركم الله به.'),
    Ayat(
        '﴿وَاصبِر لِحُكمِ رَبِّكَ فَإِنَّكَ بِأَعيُنِنا وَسَبِّح بِحَمدِ رَبِّكَ حينَ تَقومُ﴾',
        '[Aṭ-Ṭur: 48]',
        'ولما بيّن الله بطلان ما عليه المشركون أمر رسوله بعدم المبالاة بهم، وبالصبر على تكذيبهم فقال: واصبر - أيها الرسول - لقضاء ربك، ولحكمه الشرعي، فإنك بمرأى منا وحفظ، وسبح بحمد ربك حين تقوم من نومك.'),
    Ayat(
        '﴿يا بَنِيَّ اذهَبوا فَتَحَسَّسوا مِن يوسُفَ وَأَخيهِ وَلا تَيأَسوا مِن رَوحِ اللَّهِ إِنَّهُ لا يَيأَسُ مِن رَوحِ اللَّهِ إِلَّا القَومُ الكافِرونَ﴾',
        '[Yusuf: 87]',
        'قال لهم أبوهم: يا أبنائي، اذهبوا فتعرفوا من أخبار يوسف وأخيه، ولا تقنطوا من تفريج الله وتنفيسه عن عباده، إنه لا يقنط من تفريجه وتنفيسه إلا القوم الكافرون؛ لأنهم يجهلون عظيم قدرة الله وخَفِيَّ إفضاله على عباده.'),
    Ayat(
        '﴿وَابتَغِ فيما آتاكَ اللَّهُ الدّارَ الآخِرَةَ وَلا تَنسَ نَصيبَكَ مِنَ الدُّنيا وَأَحسِن كَما أَحسَنَ اللَّهُ إِلَيكَ وَلا تَبغِ الفَسادَ فِي الأَرضِ إِنَّ اللَّهَ لا يُحِبُّ المُفسِدينَ﴾',
        '[Al-Qasas: 77]',
        'واطلب فيما أعطاك الله من الأموال الثواب في الدار الآخرة؛ بأن تنفقه في وجوه الخير، ولا تنس نصيبك من الأكل والشرب واللباس وغير ذلك من النعم، في غير إسراف ولا مخيلة، وأحسن التعامل مع ربك ومع عباده كما أحسن سبحانه إليك، ولا تطلب الفساد في الأرض بارتكاب المعاصي وترك الطاعات، إن الله لا يحب المفسدين في الأرض بذلك، بل يبغضهم.'),
    Ayat(
        '﴿إِنَّ اللَّهَ وَمَلائِكَتَهُ يُصَلّونَ عَلَى النَّبِيِّ يا أَيُّهَا الَّذينَ آمَنوا صَلّوا عَلَيهِ وَسَلِّموا تَسليمًا﴾',
        '[Al-Aḥzab: 56]',
        'إن الله يثني عند ملائكته على الرسول محمد صلى الله عليه وسلم، وملائكته يدعون له، يا أيها الذين آمنوا بالله وعملوا بما شرع لعباده، صلوا على الرسول وسلموا عليه تسليمًا.'),
    Ayat('﴿وَيَنصُرَكَ اللَّهُ نَصرًا عَزيزًا﴾', '[Al-Fatḥ: 3]',
        'وينصرك الله على أعدائك نصرًا عزيزًا، لا يدفعه أحد.'),
    Ayat(
        '﴿إِذ تَلَقَّونَهُ بِأَلسِنَتِكُم وَتَقولونَ بِأَفواهِكُم ما لَيسَ لَكُم بِهِ عِلمٌ وَتَحسَبونَهُ هَيِّنًا وَهُوَ عِندَ اللَّهِ عَظيمٌ﴾',
        '[An-Nur: 15]',
        'إذ يرويه بعضكم عن بعض، وتتناقلونه بأفواهكم مع بطلانه؛ فما لكم به علم، وتظنون أن ذلك سهل هين، وهو عند الله عظيم؛ لما فيه من الكذب ورمي بريء.'),
    Ayat('﴿أَيَحسَبُ أَن لَم يَرَهُ أَحَدٌ﴾', '[Al-Balad: 7]',
        'أيظنّ هذا المتباهي بما ينفقه أن الله لا يراه؟! وأنه لا يحاسبه في ماله؛ من أين اكتسبه؟ وفيم أنفقه؟!'),
    Ayat('﴿وَلِمَن خافَ مَقامَ رَبِّهِ جَنَّتانِ﴾', '[Ar-Raḥman: 46]',
        'وللذي خاف القيام بين يدي ربه في الآخرة فآمن وعمل صالحًا - جنتان.'),
    Ayat(
        '﴿وَيَستَفتونَكَ فِي النِّساءِ قُلِ اللَّهُ يُفتيكُم فيهِنَّ وَما يُتلى عَلَيكُم فِي الكِتابِ في يَتامَى النِّساءِ اللّاتي لا تُؤتونَهُنَّ ما كُتِبَ لَهُنَّ وَتَرغَبونَ أَن تَنكِحوهُنَّ وَالمُستَضعَفينَ مِنَ الوِلدانِ وَأَن تَقوموا لِليَتامى بِالقِسطِ وَما تَفعَلوا مِن خَيرٍ فَإِنَّ اللَّهَ كانَ بِهِ عَليمًا﴾',
        '[An-Nisa’: 127]',
        'ويسألونك - أيها الرسول - في أمر النساء وما يجب لهن وعليهن، قل: الله يبين لكم ما سألتم عنه، ويبين لكم ما يتلى عليكم في القرآن، في شأن اليتامى من النساء اللاتي تحت ولايتكم، ولا تؤتونهن ما فرض الله لهن من المهر أو الميراث، ولا ترغبون في نكاحهن، وتمنعونهن من النكاح طمعًا في أموالهن، ويبين لكم ما يجب في المستضعفين من الصغار، من إعطائهم حقهم من الميراث، وألا تظلموهم بالاستيلاء على أموالهم، ويبين لكم وجوب القيام على اليتامى بالعدل بما يصلح شأنهم في الدنيا والآخرة، وما تفعلوا من خير لليتامى وغيرهم فإن الله عليم به، وسيجازيكم به.'),
    Ayat('﴿فَدَعا رَبَّهُ أَنّي مَغلوبٌ فَانتَصِر﴾', '[Al-Qamar: 10]',
        'فدعا نوح ربه قائلًا: إن قومي غلبوني، ولم يستجيبوا لي، فانتصر منهم بعقاب تنزله عليهم.'),
    Ayat('﴿إِنَّ مَعَ العُسرِ يُسرًا﴾', '[Ash-Sharḥ: 6]',
        'إن مع الشدة والضيق سهولة واتساعًا وفرجًا، إذا علمت ذلك فلا يهولنك أذى قومك، ولا يصدنك عن الدعوة إلى الله.'),
    Ayat(
        '﴿قالَ رَبِّ إِنّي ظَلَمتُ نَفسي فَاغفِر لي فَغَفَرَ لَهُ إِنَّهُ هُوَ الغَفورُ الرَّحيمُ﴾',
        '[Al-Qasas: 16]',
        'قال موسى داعيًا ربه معترفًا بما حصل منه: رب إني ظلمت نفسي بقتل هذا القِبْطي، فاغفر لي ذنبي، فبيّن الله لنا مغفرته لموسى، إنه هو الغفور لمن تاب من عباده، الرحيم بهم.'),
    Ayat('﴿رَبِّ هَب لي حُكمًا وَأَلحِقني بِالصّالِحينَ﴾', '[Ash-Shu‘ara’: 83]',
        'قال إبراهيم داعيًا ربه: رب أعطني فقهًا في الدين، وألحقني بالصالحين من الأنبياء قبلي بأن تدخلني الجنة معهم.'),
    Ayat(
        '﴿قُل إِن ضَلَلتُ فَإِنَّما أَضِلُّ عَلى نَفسي وَإِنِ اهتَدَيتُ فَبِما يوحي إِلَيَّ رَبّي إِنَّهُ سَميعٌ قَريبٌ﴾',
        '[Saba’: 50]',
        'قل - أيها الرسول - لهؤلاء المشركين المكذبين: إن ضللتُ عن الحق فيما أبلغكم فضرر ضلالي قاصر علي، لا ينالكم منه شيء، وإن اهتديتُ إليه فبسبب ما يوحيه إليَّ ربي سبحانه، إنه سميع لأقوال عباده، قريب لا يتعذر عليه سماع ما أقول.'),
    Ayat(
        '﴿لِيُنفِق ذو سَعَةٍ مِن سَعَتِهِ وَمَن قُدِرَ عَلَيهِ رِزقُهُ فَليُنفِق مِمّا آتاهُ اللَّهُ لا يُكَلِّفُ اللَّهُ نَفسًا إِلّا ما آتاها سَيَجعَلُ اللَّهُ بَعدَ عُسرٍ يُسرًا﴾',
        '[Aṭ-Ṭalaq: 7]',
        'لينفق من كان له سعة في المال على مطلقته وعلى ولده من سعته، ومن ضُيِّق عليه رزقه فلينفق مما أعطاه الله منه، لا يكلف الله نفسًا إلا ما أعطاها، فلا يكلفها فوقه، ولا فوق ما تطيقه، سيجعل الله بعد ضيق حاله وشدتها سعة وغنى.'),
    Ayat(
        '﴿وَقالَ رَبُّكُمُ ادعوني أَستَجِب لَكُم إِنَّ الَّذينَ يَستَكبِرونَ عَن عِبادَتي سَيَدخُلونَ جَهَنَّمَ داخِرينَ﴾',
        '[Ghafir: 60]',
        'وقال ربكم - أيها الناس -: وحِّدوني في العبادة والمسألة، أجب دعاءكم وأعفُ عنكم وأرحمكم، إن الذين يتعظمون عن إفرادي بالعبادة سيدخلون يوم القيامة جهنم صاغرين ذليلين.'),
    Ayat(
        '﴿إِنَّ الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ سَيَجعَلُ لَهُمُ الرَّحمنُ وُدًّا﴾',
        '[Maryam: 96]',
        'إن الذين آمنوا بالله وعملوا الأعمال الصالحات المرضية عند الله، سيجعل لهم الله محبة بحبه إياهم، وبتحبيبهم إلى عباده.'),
    Ayat('﴿وَنَسوقُ المُجرِمينَ إِلى جَهَنَّمَ وِردًا﴾', '[Maryam: 86]',
        'ونسوق الكفار إلى جهنم عطاشًا.'),
    Ayat('﴿يَومَ نَحشُرُ المُتَّقينَ إِلَى الرَّحمنِ وَفدًا﴾', '[Maryam: 85]',
        'اذكر - أيها الرسول - يوم القيامة يوم نجمع المتقين ربهم - بامتثال أوامره واجتناب نواهيه - إلى ربهم وفدًا مكرمين مُعَزَّزين.'),
    Ayat(
        '﴿وَقُل لِلمُؤمِناتِ يَغضُضنَ مِن أَبصارِهِنَّ وَيَحفَظنَ فُروجَهُنَّ وَلا يُبدينَ زينَتَهُنَّ إِلّا ما ظَهَرَ مِنها وَليَضرِبنَ بِخُمُرِهِنَّ عَلى جُيوبِهِنَّ وَلا يُبدينَ زينَتَهُنَّ إِلّا لِبُعولَتِهِنَّ أَو آبائِهِنَّ أَو آباءِ بُعولَتِهِنَّ أَو أَبنائِهِنَّ أَو أَبناءِ بُعولَتِهِنَّ أَو إِخوانِهِنَّ أَو بَني إِخوانِهِنَّ أَو بَني أَخَواتِهِنَّ أَو نِسائِهِنَّ أَو ما مَلَكَت أَيمانُهُنَّ أَوِ التّابِعينَ غَيرِ أُولِي الإِربَةِ مِنَ الرِّجالِ أَوِ الطِّفلِ الَّذينَ لَم يَظهَروا عَلى عَوراتِ النِّساءِ وَلا يَضرِبنَ بِأَرجُلِهِنَّ لِيُعلَمَ ما يُخفينَ مِن زينَتِهِنَّ وَتوبوا إِلَى اللَّهِ جَميعًا أَيُّهَ المُؤمِنونَ لَعَلَّكُم تُفلِحونَ﴾',
        '[An-Nur: 31]',
        'وقل للمؤمنات يكففن من أبصارهن عن النظر إلى ما لا يحلّ لهن النظر إليه من العورات، ويحفظن فروجهن بالبعد عن الفاحشة وبالستر، ولا يُظْهِرن زينتهن للأجانب إلا ما ظهر منها مما لا يمكن إخفاؤه كالثياب، وليضربن بأغطيتهنّ على فتحات أعلى ثيابهن ليسترن شعورهن ووجوههن وأعناقهن، ولا يُظْهِرن زينتهنّ الخفية إلا لأزواجهنّ، أو آبائهن، أو آباء أزواجهن، أو أبنائهنّ، أو أبناء أزواجهنّ، أو إخوانهنّ، أو أبناء إخوانهنّ، أو أبناء أخواتهنّ، أو نسائهنّ المأمونات، مسلمات كنّ أو كافرات، أو ما ملكن من العبيد ذكورًا أو إناثًا، أو التابعين الذين لا غرض لهم في النساء، أو الأطفال الذين لم يطّلعوا على عورات النساء لصغرهم، ولا يضرب النساء بأرجلهن قصد أن يُعْلَم ما يسترن من زينتهنّ مثل الخلخال وما شابهه، وتوبوا إلى الله جميعًا - أيها المؤمنون - مما يحصل لكم من النظر وغيره؛ رجاء أن تفوزوا بالمطلوب، وتنجوا من المرهوب.'),
    Ayat(
        '﴿وَلَقَد نَعلَمُ أَنَّكَ يَضيقُ صَدرُكَ بِما يَقولونَ * فَسَبِّح بِحَمدِ رَبِّكَ وَكُن مِنَ السّاجِدينَ * وَاعبُد رَبَّكَ حَتّى يَأتِيَكَ اليَقينُ﴾',
        '[Al-Ḥijr: 97-98-99]',
        'ولقد نعلم أنك - أيها الرسول - يضيق صدرك بما يصدر منهم من تكذيبهم لك وسخريتهم منك.\n فالجأ إلى الله بتنزيهه عما لا يليق به، والثناء عليه بصفات كماله، وكن من العابدين لله، المصلين له، ففي ذلك علاج لضيق صدرك. \n وداوم على عبادة ربك، واستمرّ عليها ما دمت حيًّا حتى يأتيك الموت وأنت على ذلك.'),
    Ayat(
        '﴿أَفَلا يَتَدَبَّرونَ القُرآنَ وَلَو كانَ مِن عِندِ غَيرِ اللَّهِ لَوَجَدوا فيهِ اختِلافًا كَثيرًا﴾',
        '[An-Nisa’: 82]',
        'لِمَ لا يتأمل هؤلاء القرآن ويدرسونه حتى يثبت لهم أنه لا يوجد فيه اختلاف ولا اضطراب؟! وحتى يعلموا صدق ما جئت به، ولو كان من عند غير الله تعالى لوجدوا فيه اضطرابًا في أحكامه واختلافًا كثيرًا في معانيه.'),
    Ayat(
        '﴿يُريدُ اللَّهُ أَن يُخَفِّفَ عَنكُم وَخُلِقَ الإِنسانُ ضَعيفًا﴾',
        '[An-Nisa’: 28]',
        'يريد الله أن يخفف عنكم فيما شرع، فلا يكلفكم ما لا تطيقون؛ لأنه عالم بضعف الإنسان في خَلْقه وخُلُقه.'),
    Ayat(
        '﴿يا أَيُّهَا النَّبِيُّ إِذا طَلَّقتُمُ النِّساءَ فَطَلِّقوهُنَّ لِعِدَّتِهِنَّ وَأَحصُوا العِدَّةَ وَاتَّقُوا اللَّهَ رَبَّكُم لا تُخرِجوهُنَّ مِن بُيوتِهِنَّ وَلا يَخرُجنَ إِلّا أَن يَأتينَ بِفاحِشَةٍ مُبَيِّنَةٍ وَتِلكَ حُدودُ اللَّهِ وَمَن يَتَعَدَّ حُدودَ اللَّهِ فَقَد ظَلَمَ نَفسَهُ لا تَدري لَعَلَّ اللَّهَ يُحدِثُ بَعدَ ذلِكَ أَمرًا﴾',
        '[Aṭ-Ṭalaq: 1]',
        'يا أيها النبي، إذا أردت أنت أو أراد أحد من أمتك طلاق زوجته فليطلقها لأول عِدَّتها؛ بأن يكون الطلاق في طُهْر لم يجامعها فيه، واحفظوا العِدَّة، لتتمكنوا من مراجعة زوجاتكم فيها إن أردتم مراجعتهنّ، واتقوا الله ربكم بامتثال أوامره واجتناب نواهيه، لا تُخْرِجوا مطلقاتكم من البيوت التي يسكنّ فيها، ولا يخرجن بأنفسهنّ، حتى تنقضي عدتهنّ؛ إلا أن يأتين بفاحشة ظاهرة مثل الزنى، وتلك الأحكام هي حدود الله التي حدّ لعباده، ومن يتجاوز حدود الله فقد ظلم نفسه حيث أوردها موارد الهلاك بسبب عصيانه لربه، لا تعلم - أيها المطلّق - لعلّ الله يحدث بعد ذلك الطلاق أمرًا لا تتوقعه فتراجعها.'),
    Ayat(
        '﴿اتلُ ما أوحِيَ إِلَيكَ مِنَ الكِتابِ وَأَقِمِ الصَّلاةَ إِنَّ الصَّلاةَ تَنهى عَنِ الفَحشاءِ وَالمُنكَرِ وَلَذِكرُ اللَّهِ أَكبَرُ وَاللَّهُ يَعلَمُ ما تَصنَعونَ﴾',
        '[Al-‘Ankabut: 45]',
        'اقرأ - أيها الرسول - على الناس ما أوحى به الله إليك من القرآن، وائت بالصلاة على أكمل وجه، إن الصلاة المؤداة بصفتها الكاملة تنهى صاحبها عن الوقوع في المعاصي والمنكرات؛ لما تحدثه من نور في القلوب يمنع من اقتراف المعاصي، ويرشد إلى عمل الصالحات، ولذكر الله أكبر وأعظم من كل شيء، والله يعلم ما تصنعونه، لا يخفى عليه من أعمالكم شيء، وسيجازيكم على أعمالكم، إن خيرًا فخير، وإن شرًّا فشر.'),
    Ayat(
        '﴿وَقُلِ الحَمدُ لِلَّهِ سَيُريكُم آياتِهِ فَتَعرِفونَها وَما رَبُّكَ بِغافِلٍ عَمّا تَعمَلونَ﴾',
        '[An-Naml: 93]',
        'وقل - أيها الرسول -: الحمد لله على نعمه التي لا تحصى، سيريكم الله آياته في أنفسكم وفي السماء والأرض والرزق، فتعرفونها معرفة ترشدكم إلى الإذعان للحق، وليس ربك بغافل عما تعملون، بل هو مطلع عليه، لا يخفى عليه منه شيء، وسيجازيكم عليه.'),
    Ayat(
        '﴿إِنَّما يَعمُرُ مَساجِدَ اللَّهِ مَن آمَنَ بِاللَّهِ وَاليَومِ الآخِرِ وَأَقامَ الصَّلاةَ وَآتَى الزَّكاةَ وَلَم يَخشَ إِلَّا اللَّهَ فَعَسى أُولئِكَ أَن يَكونوا مِنَ المُهتَدينَ﴾',
        '[At-Tawbah: 18]',
        'إنما يستحق عمارة المساجد ويقوم بحقها من آمن بالله وحده، ولم يشرك به أحدًا، وآمن بيوم القيامة، وأقام الصلاة وأعطى زكاة ماله، ولم يَخَفْ أحدًا إلا الله سبحانه، فهؤلاء هم الذين يُرْجى أن يكونوا مهتدين إلى الصراط المستقيم، وأما المشركون فهم أبعد ما يكونون عن ذلك.'),
    Ayat(
        '﴿فَاصبِر عَلى ما يَقولونَ وَسَبِّح بِحَمدِ رَبِّكَ قَبلَ طُلوعِ الشَّمسِ وَقَبلَ غُروبِها وَمِن آناءِ اللَّيلِ فَسَبِّح وَأَطرافَ النَّهارِ لَعَلَّكَ تَرضى﴾',
        '[Ṭa Ha: 130]',
        'فاصبر - أيها الرسول - على ما يقوله المكذبون بك من أوصاف باطلة، وسبّح بحمد ربك في صلاة الفجر قبل طلوع الشمس، وفي صلاة العصر قبل غروبها، وفي صلاة المغرب والعشاء من ساعات الليل، وفي صلاة الظهر عند الزوال بعد نهاية الطرف الأول من النهار وفي صلاة المغرب بعد نهاية الطرف الثاني منه؛ رجاء أن تنال عند الله من الثواب ما ترضى به.'),
    Ayat(
        '﴿وَأَقيمُوا الصَّلاةَ وَآتُوا الزَّكاةَ وَما تُقَدِّموا لِأَنفُسِكُم مِن خَيرٍ تَجِدوهُ عِندَ اللَّهِ إِنَّ اللَّهَ بِما تَعمَلونَ بَصيرٌ﴾',
        '[Al-Baqarah: 110]',
        'ثم بعد أمر الله تعالى المؤمنين بالصبر على الأذى أمرهم بالثبات على دينهم، وتقوية إيمانهم؛ فقال:\n أدّوا الصلاة تامة بأركانها وواجباتها وسننها، وأخرجوا زكاة أموالكم إلى مستحقيها، ومهما تعملوا من عمل صالح في حياتكم، فتقدموه قبل مماتكم ذخرًا لأنفسكم؛ تجدوا ثوابه عند ربكم يوم القيامة، فيجازيكم به، إن الله بما تعملون بصير فيجازي كلَّا بعمله.'),
    Ayat(
        '﴿وَالَّذينَ يُمَسِّكونَ بِالكِتابِ وَأَقامُوا الصَّلاةَ إِنّا لا نُضيعُ أَجرَ المُصلِحينَ﴾',
        '[Al-A‘raf: 170]',
        'والذين يتَمَسَّكون بالكتاب، ويعملون بما فيه، ويقيمون الصلاة بالمحافظة على أوقاتها وشروطها وواجباتها وسننها، سيجازيهم الله على أعمالهم، فالله لا يضيع أجرَ مَن عملُه صالح.'),
    Ayat(
        '﴿وَمِنَ النّاسِ مَن يَعبُدُ اللَّهَ عَلى حَرفٍ فَإِن أَصابَهُ خَيرٌ اطمَأَنَّ بِهِ وَإِن أَصابَتهُ فِتنَةٌ انقَلَبَ عَلى وَجهِهِ خَسِرَ الدُّنيا وَالآخِرَةَ ذلِكَ هُوَ الخُسرانُ المُبينُ﴾',
        '[Al-Ḥajj: 11]',
        'ومن الناس مضطرب يعبد الله على شك، فإن أصابه خير من صحة وغنى استمرّ على إيمانه وعبادته لله، وإن أصابه ابتلاء بمرض وفقر تشاءم بدينه فارتدّ عنه، خسر دنياه، فلن يزيده كفره حظًّا من الدنيا لم يكتب له، وخسر آخرته بما يلقاه من عذاب الله، ذلك هو الخسران الواضح.'),
    Ayat(
        '﴿وَلَنَبلُوَنَّكُم بِشَيءٍ مِنَ الخَوفِ وَالجوعِ وَنَقصٍ مِنَ الأَموالِ وَالأَنفُسِ وَالثَّمَراتِ وَبَشِّرِ الصّابِرينَ﴾',
        '[Al-Baqarah: 155]',
        'ولنَمْتحِننّكم بأنواع من المصائب؛ بشيء من الخوف من أعدائكم، وبالجوع لقلة الطعام، وبنقص في الأموال لذهابها أو مشقة الحصول عليها، وبنقص في الأنفس بسبب الآفات التي تهلك الناس، أو بالشهادة في سبيل الله، وبنقص من الثمرات التي تنبتها الأرض، وبشّر - أيها النبي - الصابرين على تلك المصائب بما يسرهم في الدنيا والآخرة.'),
    Ayat(
        '﴿اقرَأ كِتابَكَ كَفى بِنَفسِكَ اليَومَ عَلَيكَ حَسيبًا﴾',
        '[Al-Isra’: 14]',
        'ونقول له يومئذ: اقرأ - أيها الإنسان- كتابك، وتولَّ حساب نفسك على أعمالك، كفى بنفسك يوم القيامة محاسبًا لك.')
  ];

  String getAya(int num) {
    return _ayat[num].ayatCtx;
  }

  String getSrc(int num) {
    return _ayat[num].source;
  }

  String getTafsir(int num) {
    return _ayat[num].tafssir;
  }
}
